backend/controllers/AlamatController.php

    public function actionDelete($id_alamat)
    {
        $this->findModel($id_alamat)->delete();
---
DELETE FROM `alamat` WHERE `id_alamat`=5

    protected function findModel($id_alamat)
    {
        if (($model = Alamat::findOne(['id_alamat' => $id_alamat])) !== null) {
---
SELECT * FROM `alamat` WHERE `id_alamat`='5'