backend/controllers/OrderDisplayController.php

    public function actionIndex()
    {
        $searchModel = new OrderDisplaySearch();
        $dataProvider = $searchModel->search($this->request->queryParams);

        $searchModel1 = new OrderDisplaySearch();
        $dataProvider1 = $searchModel1->search(Yii::$app->request->queryParams);
        $dataProvider1->query->andWhere(['jenis_layanan' => 1]);

        $searchModel2 = new OrderDisplaySearch();
        $dataProvider2 = $searchModel2->search(Yii::$app->request->queryParams);
        $dataProvider2->query->andWhere(['jenis_layanan' => 2]);

        $modelorder = OrderDisplay::find()->all();
---
SELECT * FROM `order_display`

    public function actionCreate()
    {
        $user = Yii::$app->user->identity;
        $model = new OrderDisplay();
        $model->id_user = $user->id;
        $model->tgl_pesan = date('Y-m-d H:i:s');
        $model->status = 'dipesan';
        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                $kondisi = Yii::$app->request->post('kondisi_ac', []);
                if ($model->save()) {
                    foreach ($kondisi as $data) {

                        $data_kondisi = KondisiAc::find()->where(['id' => $data])->one();
                        // print_r($data_kondisi->nama);
                        // die();
                        $data2 = new KondisAcorder();
                        $data2->id_order = $model->id_order;
                        $data2->kondisi = $data_kondisi->nama;
                        $data2->save();
                    }
                }
                $modelnotiforder = new NotifikasiOrder();
                $modelnotiforder->id_order = $model->id_order;
                $modelnotiforder->jenis_layanan = $model->jenis_layanan;
                $modelnotiforder->judul = $model->status;
                $modelnotiforder->keterangan = 'Orderan';
                $modelnotiforder->create_at = date('Y-m-d H:i:s');
                $modelnotiforder->save(false);
---
INSERT INTO `order_display` (`id_user`, `tgl_pesan`, `status`, `jumlah`, `jenis_layanan`, `detail`, `masalah`, `id_merk`, `type_ac`, `alamat`, `jadwal_pengerjaan`) VALUES (116, '2023-05-17 11:37:16', 'dipesan', 10, '1', 'sdcwdsa', 'qwdsaxz', 2, 'e213233', '6', '2023-06-05')
SELECT * FROM `kondisi_ac` WHERE `id`='3'
INSERT INTO `kondis_acorder` (`id_order`, `kondisi`) VALUES (105, 'Kotor')
INSERT INTO `notifikasi_order` (`id_order`, `jenis_layanan`, `judul`, `keterangan`, `create_at`) VALUES (105, '1', 'dipesan', 'Orderan', '2023-05-17 11:37:16')

    public function actionUpdate($id_order)
    {
        $model = $this->findModel($id_order);
        if (Yii::$app->user->identity->role == 'teknisi') {
            $id_user = Yii::$app->user->identity->id;
            $teknisiId = Teknisi::find()
                ->select('teknisi.id_teknisi')
                ->joinWith('user')
                ->where(['user.id' => $id_user])
                ->scalar();
            $model->id_teknisi = $teknisiId;
            $teknisi = Teknisi::find()->where(['id_teknisi' => $teknisiId])->one();
            if ($teknisi->point < 10) {
                Yii::$app->session->setFlash('error', 'Anda tidak dapat mengambil pesanan karena jumlah poin Anda kurang, Silahkan Top Up');
                return $this->redirect(['index']);
            }
        }

        $jumlahAc = $model->jumlah;
        // kurang sama dengan, atau lebih sama dengan
        $point = PointMaster::find()->where(['>=', 'jumlah_ac', $jumlahAc])->one();
---
SELECT * FROM `point_master` WHERE `jumlah_ac` >= 2

    protected function findModel($id_order)
    {
        if (($model = OrderDisplay::findOne(['id_order' => $id_order])) !== null) {
---
SELECT * FROM `order_display` WHERE `id_order`='109'