backend/controllers/PelangganController.php

SELECT * FROM `pelanggan` WHERE `id_pelanggan`='31'
---
    protected function findModel($id_pelanggan)
    {
        if (($model = Pelanggan::findOne(['id_pelanggan' => $id_pelanggan])) !== null) {