backend/controllers/PointHistoryController.php

SELECT * FROM `point_history` WHERE `id`='12'
---
    protected function findModel($id)
    {
        if (($model = PointHistory::findOne(['id' => $id])) !== null) {