backend/controllers/SiteController.php

SELECT * FROM `user` WHERE `username`='teknisi'
---
    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $this->layout = 'blank';

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $user = User::findOne(['username' => $model->username]);