backend/views/order-display/_form.php

    <?= $form->field($model, 'jumlah')->label('Jumlah Ac')->textInput() ?>


    <?= $form->field($model, 'jenis_layanan')->label('Jenis Layanan')->dropDownList(
        ArrayHelper::map(\backend\models\Layanan::find()->all(), 'id_layanan', 'nama_layanan'),
        ['prompt' => '- Pilih Jenis Layanan -']
    ) ?>
---
SELECT * FROM `layanan`

    <?php if (!$model->isNewRecord && empty($model->masalah)) : ?>
        <?= Html::label('Kondisi AC') ?>
        <br>
        <?php $kondisi = KondisiAc::find()->all(); ?>
---
SELECT * FROM `kondisi_ac`

    <?php endif; ?>


    <?= $form->field($model, 'id_merk')->label('Merk AC')->dropDownList(
        ArrayHelper::map(\backend\models\MerkAc::find()->all(), 'id', 'nama'),
        ['prompt' => 'Pilih Merk Ac']
    ) ?>

    <?= $form->field($model, 'type_ac')->textInput(['maxlength' => true, 'placeholder' => 'Nomor Seri AC / Boleh kosong']) ?>

    <?= $form->field($model, 'alamat')->dropDownList(
        ArrayHelper::map(\backend\models\Alamat::find()->where(['id_user' => $model->id_user])->all(), 'id_alamat', 'alamat', 'provinsi'),
        ['prompt' => 'Pilih Alamat']
    ) ?>
---
SELECT * FROM `merk_ac`
SELECT * FROM `alamat` WHERE `id_user`=116