backend/views/order-display/index.php

SELECT * FROM `teknisi` WHERE `id_user`=119
---
if (!Yii::$app->user->isGuest) {
    // Mendapatkan model pengguna yang telah login
    $user = Yii::$app->user->identity;
    $teknisi = Teknisi::find()->where(['id_user' => $user->id])->one();

SELECT * FROM `alamat` WHERE `id_user`=116
SELECT * FROM `layanan` WHERE `id_layanan`='1'
SELECT * FROM `pelanggan` WHERE `id_user`=116
---
                <?php
                $no = 1;
                foreach ($modelorder as $data) {
                    $alamat = Alamat::find()->where(['id_user' => $data->id_user])->one();
                    $layanan = Layanan::find()->where(['id_layanan' => $data->jenis_layanan])->one();
                    $pelanggan = Pelanggan::find()->where(['id_user' => $data->id_user])->one();

SELECT * FROM `teknisi` WHERE `id_teknisi`=72
---
                            //'masalah',
                            //'id_merk',
                            //'type_ac',
                            'alamat',
                            //'jadwal_pengerjaan',
                            'status',
                            //'tgl_pesan',
                            'id_teknisi' => [
                                'label' => 'Nama Teknisi',
                                'attribute' => 'id_teknisi',
                                'value' => function ($model) {
                                    $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();
                                    return $teknisi ? $teknisi->nama_lengkap : "Teknisi Belum Ada";
                                },
                            ],
                            //'point_teknisi',
                            [
                                'class' => ActionColumn::className(),
                                'urlCreator' => function ($action, OrderDisplay $model, $key, $index, $column) {
                                    return Url::toRoute([$action, 'id_order' => $model->id_order]);
                                }
                            ],
                        ],
                    ]); ?>

SELECT * FROM `pelanggan` WHERE `id_user`=118
---
                    'label' => 'Nama Pelanggan',
                    'attribute' => 'id_merk',
                    'value' =>  function ($model) {
                        $pelanggan = Pelanggan::find()->where(['id_user' => $model->id_user])->one();

SELECT * FROM `alamat` WHERE `id_alamat`='6'
---
                    'alamat' => [
                        'attribute' => 'alamat',
                        'value' => function ($model) {
                            $alamat = Alamat::find()->where(['id_alamat' => $model->alamat])->one();