backend/views/order-display/view.php

SELECT * FROM `feedback` WHERE `id_order`=110
SELECT * FROM `invoice` WHERE `id_order`=110
---
?>

<?php
$modelfeedback = Feedback::find()->where(['id_order' => $model->id_order])->one();
$modelinvoice = Invoice::find()->where(['id_order' => $model->id_order])->one();

SELECT * FROM `alamat` WHERE `id_alamat`='4'
SELECT * FROM `merk_ac` WHERE `id`=1
SELECT * FROM `pelanggan` WHERE `id_user`=116
SELECT * FROM `teknisi` WHERE `id_teknisi` IS NULL
---

        <?php if (Yii::$app->user->identity->role == 'admin') : ?>
            <?php
            $alamat = Alamat::find()->where(['id_alamat' => $model->alamat])->one();
            $merk = MerkAc::find()->where(['id' => $model->id_merk])->one();
            $pelanggan = Pelanggan::find()->where(['id_user' => $model->id_user])->one();
            $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();

SELECT * FROM `kondis_acorder` WHERE `id_order`=96
---
                        ],
                        'detail',
                        'masalah',
                        [
                            'label' => 'Kondisi Ac',
                            'value' => function ($model) {
                                $kondisiacorder = KondisAcorder::find()->where(['id_order' => $model->id_order])->all();
                                $kondisiAcArray = [];
                                foreach ($kondisiacorder as $kondisi) {
                                    $kondisiAcArray[] = $kondisi->kondisi; //ganti attribute dengan atribut yang diinginkan dari model KondisAcorder
                                }
                                return implode(", ", $kondisiAcArray);
                            },
                        ],

SELECT * FROM `teknisi` WHERE `id_teknisi` IS NULL
---
                        'jadwal_pengerjaan',
                        'status',
                        'tgl_pesan',
                        'id_teknisi' => [
                            'label' => 'Nama Teknisi',
                            'attribute' => 'id_teknisi',
                            'value' => function ($model) {
                                $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();
                                return $teknisi ? $teknisi->nama_lengkap : "Teknisi Belum Ada";
                            },
                        ],

SELECT * FROM `alamat` WHERE `id_alamat`='8'
SELECT * FROM `merk_ac` WHERE `id`=1
SELECT * FROM `pelanggan` WHERE `id_user`=118
SELECT * FROM `teknisi` WHERE `id_teknisi` IS NULL
---

            <?php if (Yii::$app->user->identity->role == 'teknisi') : ?>
                <?php
                $alamat = Alamat::find()->where(['id_alamat' => $model->alamat])->one();
                $merk = MerkAc::find()->where(['id' => $model->id_merk])->one();
                $pelanggan = Pelanggan::find()->where(['id_user' => $model->id_user])->one();
                $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();

SELECT * FROM `kondis_acorder` WHERE `id_order`=110
---
                            [
                                'label' => 'Kondisi Ac',
                                'value' => function ($model) {
                                    $kondisiacorder = KondisAcorder::find()->where(['id_order' => $model->id_order])->all();

SELECT * FROM `teknisi` WHERE `id_teknisi` IS NULL
---
                                'label' => 'Nama Teknisi',
                                'attribute' => 'id_teknisi',
                                'value' => function ($model) {
                                    $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();