backend/views/order-history/index.php

if (!Yii::$app->user->isGuest) {
    // Mendapatkan model pengguna yang telah login
    $user = Yii::$app->user->identity;
    $teknisi = Teknisi::find()->where(['id_user' => $user->id])->one();
---
SELECT * FROM `teknisi` WHERE `id_user`=116

    <?php if (Yii::$app->user->identity->role == 'customer') : ?>
        <div class="card">
            <div class="card-body table-hover">
                <?= GridView::widget([
                    'dataProvider' => $dataProvider,
                    'columns' => [
                        ['class' => 'yii\grid\SerialColumn'],

                        'id_historis',
                        'id_user',
                        'id_order',
                        'jenis_layanan',
                        'tanggal',
                        [
                            'attribute' => 'id_teknisi',
                            'label' => 'Teknisi',
                            'value' => function ($model) {
                                $teknisi = Teknisi::find()->where(['id_teknisi' => $model->id_teknisi])->one();
                                return isset($teknisi->nama_lengkap) ? $teknisi->nama_lengkap : 'Tidak Ada Teknisi';
                            }
                        ],

                        //'status',
                        [
---
SELECT * FROM `teknisi` WHERE `id_teknisi` IS NULL