backend/views/alamat/_form.php

SELECT * FROM `alamat_kategori`
---

    <?= $form->field($model, 'longitude')->textInput(['placeholder' => 'Masukkan longitude']) ?>

    <?= $form->field($model, 'id_kategori')->dropDownList(
      ArrayHelper::map(\backend\models\AlamatKategori::find()->all(), 'id', 'nama'),
      [
        'prompt' => '- Pilih Kategori -',
      ]
    ) ?>