backend/views/alamat/_form.php

use kartik\select2\Select2;

$user = Yii::$app->user->identity;
$pelanggan = Pelanggan::find()->where(['id_user' => $user->id])->one();
---
SELECT * FROM `pelanggan` WHERE `id_user`=116

        'readonly' => true,
      ]) ?>
    <?php else : ?>
      <?= $form->field($model, 'id_user')->label('Nama Pelanggan')->dropDownList(
        ArrayHelper::map(\backend\models\Pelanggan::find()->all(), 'id_user', 'nama'),
        ['prompt' => 'Pilih Nama Pelanggan']
      ) ?>
    <?php endif; ?>

    <?= $form->field($model, 'provinsi')->widget(Select2::class, [
      'data' => ArrayHelper::map(TbProvinsi::find()->all(), 'id', 'nama'),
      'options' => [
        'placeholder' => '-Pilih-',
        'onchange' => '$.post("listregs?id=' . '"+$(this).val(),
            function(data) {
                $("#kota-select").html(data);
            });'
      ],
      'pluginOptions' => [
        'allowClear' => true
      ],
    ])->label('Provinsi') ?>
---
SELECT * FROM `pelanggan`
SELECT * FROM `tb_provinsi`