backend/views/alamat/index.php

SELECT * FROM `pelanggan` WHERE `id_user`=116
SELECT * FROM `tb_provinsi` WHERE `id`='32'
---
                ['class' => 'yii\grid\SerialColumn'],

                // 'id_alamat',
                'id_user' => [
                    'attribute' => 'id_user',
                    'label' => 'Nama Pelanggan',
                    'value' => function ($model) {
                        $pelanggan = Pelanggan::find()->where(['id_user' => $model->id_user])->one();
                        return $pelanggan ? $pelanggan->nama : "Pelanggan Belum Ada";
                    },
                ],
                'provinsi' => [
                    'attribute' => 'provinsi',
                    'label' => 'Provinsi',
                    'value' => function ($model) {
                        $provinsi = TbProvinsi::find()->where(['id' => $model->provinsi])->one();
                        return $provinsi ? $provinsi->nama : "Tidak Ada Provinsi";
                    }
                ],

SELECT * FROM `tb_kota_kabupaten` WHERE `id`='1171'
---
                    'attribute' => 'kota',
                    'label' => 'Kota/Kabupater',
                    'value' => function ($model) {
                        $kota = TbKotaKabupaten::find()->where(['id' => $model->kota])->one();

SELECT * FROM `tb_kecamatan` WHERE `id`='1101020'
---
                    'attribute' => 'kecamatan',
                    'label' => 'Kecamatan',
                    'value' => function ($model) {
                        $kecamatan = TbKecamatan::find()->where(['id' => $model->kecamatan])->one();