backend/views/point-history/index.php

if (!Yii::$app->user->isGuest) {
    // Mendapatkan model pengguna yang telah login
    $user = Yii::$app->user->identity;
    $teknisi = Teknisi::find()->where(['id_user' => $user->id])->one();
---
SELECT * FROM `teknisi` WHERE `id_user`=117