backend/views/point-history/view.php

SELECT * FROM `topup` WHERE `id_user`=117
SELECT * FROM `topup` WHERE `jumlah_point`=100
---

    <?= DetailView::widget([
        'model' => $model,
        'attributes' => [
            'id',
            'id_user',
            'point',
            'created_at',
            [
                'label' => 'Keterangan',
                'value' => function ($model) {
                    $topupket = Topup::find()->where(['jumlah_point' => $model->point])->one();
                    return $topupket ? $topupket->keterangan : "Give Point";
                },
            ],
        ],